<?xml version="1.0" encoding="utf-8"?>
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0"
  xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>Visual Studio</displayName>
  <description>Manage features for Visual Studio.</description>
  <resources>
    <stringTable>
      <string id="VisualStudioProductName">Visual Studio</string>

      <!-- Category Names -->
      <string id="VisualStudioCategoryName">Visual Studio</string>

      <string id="FeedbackSettingsCategoryName">Feedback Settings</string>
      <string id="InstallandUpdateSettingsCategoryName">Install and Update Settings</string>
      <string id="LiveShareSettingsCategoryName">Live Share Settings</string>
      <string id="PrivacySettingsCategoryName">Privacy Settings</string>
      
      <!-- The VS catalog Product Names. -->
      <string id="VisualStudioProductName2017">Visual Studio 2017</string>
      <string id="VisualStudioProductName2019">Visual Studio 2019</string>
      <string id="VisualStudioProductName2022">Visual Studio 2022</string>

      <!-- The VS catalog minor versions. -->
      <string id="VisualStudioProductName2022_1">Visual Studio 2022, 17.1</string>
      <string id="VisualStudioProductName2022_4">Visual Studio 2022, 17.4</string>

      <!-- Convey a particular version and higher. -->
      <string id="VisualStudio2017">Visual Studio 2017 and higher.</string>
      <string id="VisualStudio2019">Visual Studio 2019 and higher.</string>
      <string id="VisualStudio2022">Visual Studio 2022 and higher.</string>
      <string id="VisualStudio2022_1">Visual Studio 2022, 17.1 and higher.</string>
      <string id="VisualStudio2022_4">Visual Studio 2022, 17.4 and higher.</string>

      <!-- Convey a particular version and distribution. -->
      <string id="VisualStudio2022_Enterprise_Professional">At least Visual Studio 2022, Enterprise and Professional only</string>
      
      <!-- Policy Display Names and Explain Text. -->
      <!-- Feedback -->
      <string id="DisableFeedbackDialog_DisplayName">Disable the send-a-smile feature</string>
      <string id="DisableFeedbackDialog_Explain">This policy disables the Visual Studio send-a-smile feature.</string>
      <string id="DisableScreenshotCapture_DisplayName">Disables send-a-smile's screenshot capability</string>
      <string id="DisableScreenshotCapture_Explain">This policy disables the screenshot capability in the send-a-smile feature.</string>
      
      <!-- Install and Update -->
      <string id="RemoveOutOfSupport_DisplayName">Remove out-of-support components</string>
      <string id="RemoveOutOfSupport_Explain">This setting will automatically remove all components from the Visual Studio installation that have transitioned to an out-of-support state.
        
If set to 1, then the Visual Studio installer will remove all out-of-support components during all subsequent updates.  If set to 0 or missing entirely, then the removeOos behavior will respect other locations where this can be configured, such as commandline parameter or the Update Settings dialog.
        
This functionality requires the Visual Studio 2022 version 17.4 installer to be installed on the client machine.        

For more information, see https://aka.ms/vs/removeoos/blog</string>
    
      <string id="CachePath_DisplayName">Package manifest and payload cache path</string>
      <string id="CachePath_Explain">The directory where package manifests and, optionally, payloads are stored.

The Visual Studio Installer enforces a 50 character limit for the path.

For more information, see https://aka.ms/DisableOrMovePackageCache</string>
  
      <string id="BackgroundDownloadDisabled_DisplayName">Disable downloading updates automatically</string>
      <string id="BackgroundDownloadDisabled_Explain">Prevent setup from downloading updates automatically for all installed Visual Studio products. You can change the value anytime.</string>
      <string id="SharedInstallationPath_DisplayName">Shared installation path</string>
      <string id="SharedInstallationPath_Explain">The directory where some packages shared across versions of instances of Visual Studio are installed. You can change the value anytime, but it will only affect future installs. Any products already installed to the old location must not be moved or they might not function correctly.

The Visual Studio Installer enforces a 150 character limit for the path.</string>

      <string id="KeepDownloadedPayloads_DisplayName">Keep package payloads after installation</string>
      <string id="KeepDownloadedPayloads_Explain">Keep package payloads even after they are installed. You can change the value anytime. Disabling the policy removes any cached package payloads for the instance you repair or modify.

Enabled by default.

For more information, see: https://aka.ms/DisableOrMovePackageCache</string>

      <string id="AdministratorUpdatesEnabled_DisplayName">Enable administrator updates</string>
      <string id="AdministratorUpdatesEnabled_Explain">Allows administrator updates to be visible to and applied to the client computer. This value is for administrative use.
        
If set to 1, then administrator updates delivered through WSUS and SCCM will be available to Active Direcotry (AD) joined client machines.  
        
If set to 2, then administrator updates delivered through either WSUS/SCCM or Intune/Microsoft Endpoint Manager will be available to either Active Directory (AD) or Azure Active Directory (AAD) joined machines that are enrolled in Windows Update for Business (WUfB). Note that the WUfB AllowMUUpdateServicePolicy must be turned on too.

If set to 0 or missing entirely, then administrator updates will not be available to the machine.        
        
For more information, see https://aka.ms/EnableAdminUpdates.</string>

      <string id="AdministratorUpdatesEnabled_EnabledForCatalogAndWSUS">Administrator Updates Enabled for Catalog and WSUS</string>
      <string id="AdministratorUpdatesEnabled_EnabledForCatalogWSUSAndMU">Administrator Updates Enabled for Catalog, WSUS and Microsoft Updates</string>

      <string id="AdministratorUpdatesOptOut_DisplayName">Opt out of administrator updates</string>
      <string id="AdministratorUpdatesOptOut_Explain">Indicates that the user does not want to receive administrator updates to Visual Studio. The absence of the registry value, or a set value of 0, means that the Visual Studio user wants to receive administrator updates to Visual Studio. This is for developer user (if they have admin permissions on the client machine). For more information, see Applying administrator updates. If AdministratorUpdatesOptOut is set to 1 but the user’s AdministratorUpdatesEnabled registry value is enabled, the AdministratorUpdatesOptOut is respected. </string>
      <string id="UpdateConfigurationFile_DisplayName">Custom path to the update config</string>
      <string id="UpdateConfigurationFile_Explain">The custom file path to the update configuration file used for configuring Administrative Updates. For more information, see https://aka.ms/MethodsForConfiguringAdminUpdates.</string>

      <string id="DisableRollback_DisplayName">Disable the ability to rollback or undo a Visual Studio update</string>
      <string id="DisableRollback_Explain">This policy setting determines whether the user can undo an update and rollback Visual Studio to the previously installed version.

If set to 1, then users will be prevented from accessing the rollback capability, which will prevent Visual Studio from reverting the most recent update which may contain a security fix.

If set to 0 or missing entirely, then users will be able to access the rollback feature in Visual Studio, and will be able to undo an update and rollback their Visual Studio instances to the previously installed version. Note: The default unconfigured setting enables the ability to rollback a Visual Studio update.

This policy applies to release instances of Visual Studio 2022 or higher that is installed on the machine.
For more information, see https://aka.ms/vs/rollback</string>
      
      <!-- LiveShare -->
      <string id="LiveShare_DomainName_DisplayName">Allow only company domain accounts</string>
      <string id="LiveShare_DomainName_Explain">Prevents users from being able to share their session with any guests who are not part of their company or any other company that has been given access. Users must be logged in with their company email to access Live Share. If this policy is disabled, any user from any organization can access a shared Live Share session. Use ; to separate out multiple domains. For example, set the domain name as contoso.com or contoso.com;foo.com 
For more information, see: https://aka.ms/vsls-policies </string>
      <string id="LiveShare_DirectConnectionMode_DisplayName">Require direct connection</string>
      <string id="LiveShare_DirectConnectionMode_Explain">Prevents hosts from allowing relay-based guests from joining their session. Live Share already supports the “Live Share: Connection Mode” setting, and so this policy is effectively just enforcing it to “direct”. If this policy is disabled, the host can allow relay-based guests to join their session if the host has not configured the “Live Share: Connection Mode” setting.
For more information, see: https://aka.ms/vsls-policies</string>
      <string id="LiveShare_DisableAnonymousGuests_DisplayName">Disable anonymous guests</string>
      <string id="LiveShare_DisableAnonymousGuests_Explain">Disallow anonymous guests from joining a session. Live Share already has the “Live Share: Anonymous Guest Approval” setting, and so this policy is effectively just enforcing that to “reject”.
For more information, see: https://aka.ms/vsls-policies </string>
      <string id="LiveShare_GuestApprovalRequired_DisplayName">Require guest approval</string>
      <string id="LiveShare_GuestApprovalRequired_Explain">Guest can join the session only after host approves. Live Share already has the “Live Share: Guest Approval required” setting, and so this policy is effectively just enforcing that to “true”.
For more information, see: https://aka.ms/vsls-policies</string>
      <string id="LiveShare_DisableSharedServer_DisplayName">Disable shared server</string>
      <string id="LiveShare_DisableSharedServer_Explain">Prevent the host from being able to explicitly share a new server. The policy also enforces “Live Share: Auto Share Servers” setting to false.
For more information, see: https://aka.ms/vsls-policies</string>
      <string id="LiveShare_DisableReadWriteTerminal_DisplayName">Disable shared read write terminal</string>
      <string id="LiveShare_DisableReadWriteTerminal_Explain">Prevent the host from being able to explicitly share a new writeable terminal.
For more information, see: https://aka.ms/vsls-policies</string>

       <!-- Privacy -->
      <string id="TelemetryOptIn_DisplayName">Enable the Visual Studio Customer Experience Improvement Program</string>
      <string id="TelemetryOptIn_Explain">This policy enables Visual Studio telemetry to be sent to Microsoft as part of the Visual Studio Customer Experience Improvement Program. For more information, see: aka.ms/vs/admx/telemetry</string>
      <string id="IntelliCodeRemoteAnalysisDisabled_DisplayName">Disable IntelliCode custom model training</string>
      <string id="IntelliCodeRemoteAnalysisDisabled_Explain">This policy disables the ability to train custom IntelliCode models for IntelliSense completions.</string>

    </stringTable>
    <presentationTable>
      <presentation id="AdministratorUpdatesEnabled_PresentationId">
         <dropdownList refId="AdministratorUpdatesEnabledDropID" noSort="true" defaultItem="0" />
      </presentation>
      <presentation id="CachePath_PresentationId">
        <textBox refId="CachePath_TextBox">
          <label>Package Manifest and Payload Cache Path</label>
        </textBox>
      </presentation>
      <presentation id="SharedInstallationPath_PresenationId">
        <textBox refId="SharedInstallationPath_TextBox">
          <label>Shared Installation Path</label>
        </textBox>
      </presentation>
      <presentation id="UpdateConfigurationFile_PresentationId">
        <textBox refId="UpdateConfigurationFile_TextBox">
          <label>Custom Path to the Update Config</label>
        </textBox>
      </presentation>

      <!-- LiveShare Presentations -->
      <presentation id="LiveShare_DomainName_PresentationId">
      <textBox refId="LiveShare_DomainName_TextBox">
        <label>Enter Domain Name:</label>
        </textBox>
    </presentation>
    </presentationTable>
</resources>
</policyDefinitionResources>
